/**
 * Created by nprikazchikov on 3/2/15.
 */

var engineeringControllers = angular.module('engineeringControllers', []);

engineeringControllers.controller('HeaderController', ['$scope', '$location', 'VisibilityFactory', '$translate',
    function ($scope, $location, VisibilityFactory, $translate) {
        $scope.$location = $location;

        $scope.changeLanguage = function (langKey) {
            $translate.use(langKey);
        };

        $scope.toggleFilter = function () {
            VisibilityFactory.data.filter = !VisibilityFactory.data.filter;
        }
    }]);

engineeringControllers.controller( 'DefaultController', ['$scope', 'VisibilityFactory',
    function ($scope, VisibilityFactory) {
        $scope.visibility = VisibilityFactory.data;
    }]);

engineeringControllers.controller( 'ProgramController', ['$scope', 'VisibilityFactory',
    function ($scope, VisibilityFactory) {
        $scope.visibility = VisibilityFactory.data;

        $scope.reports = [
            {
                author:"Боровских Валентин Ефимович",
                title: "«Современные проблемы оценки ресурса  транспортных машин»",
                desc:"д.т.н.,  профессора кафедры  «Техническая механика и детали машин» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Архангельсий  Юри  Сергеевич",
                title: "«Принципы создания интеллектуальных СВЧ технологических установок»",
                desc:"д.т.н., профессора кафедры  «Автоматизированные электротехнологические установки и системы » СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Бекренев Николай  Валерьевич",
                title: "«Актуальные проблемы конструирования и технологии производства технологических, транспортных и энергетических машин в свете решения задачи импортозамещения в ключевых областях техники»",
                desc:"д.т.н., профессора, заведующего  кафедрой «Техническая механика и детали машин» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Погораздов Валерий Васильевич",
                title: "«Концепция суперфинишного формообразования тел качения переменной кривизны»",
                desc:"д.т.н., профессора кафедры  «Проектирование технических и технологических комплексов» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Астахов Владимир Владимирович",
                title: "«Нелинейные эффекты в хаотических и стохастических системах»",
                desc:"д. ф-м. н., профессора, заведующего кафедрой «Радиоэлектроника и телекоммуникации» СГТУ имени Гагарина Ю.А"
            }
        ];

        $scope.sections = [
            {
                title: "Секция 1. Машиноведение, транспортное и энергетическое машиностроение",
                person: "Боровских Валентин Ефимович",
                personDescription: "д.т.н., профессор кафедры «Техническая механика и детали машин,  эксперт ФГБНУ НИИ РИНКЦЭ",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/242",
                desc: "Секция посвящена обсуждению результатов исследований в области расчета и проектирования технических систем;  исследование процессов формообразования сложных поверхностей с применением 3D компьютерных технологий;  оценка прочности и устойчивости элементов  металлоконструкций от действия статической нагрузки; режимы нагружения различных машин и их эксплуатационный ресурс; современные методы оценки ресурса элементов конструкций, работающих в условиях нагрузок переменных во времени; новые подходы к оценке и учету трения в проектируемых технических системах; вопросы проектирования несущих систем транспортных машин; вопросы обеспечения точности и надежности мехатронных систем различного назначения; рассматриваются различные подходы к построению математических моделей технологических процессов: аналитические, экспериментальные, экспериментально-аналитические; анализ для интерпретации моделируемых явлений, использование в задачах управления, оптимизации и т.п."
            },
            {
                title: "Секция 2. Технология машиностроения",
                person: "Королев Альберт Викторович",
                personDescription: "д.т.н., профессор кафедры «Технология машиностроения»",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/259",
                desc: "Секция посвящена обсуждению результатов теоретических и экспериментальных        исследований, связанных с проблемам совершенствования технологического обеспечения, механообрабатывающих и механосборочных производств. Особое внимание уделяется ресурсосберегающим безотходным и малоотходным технологиям; автоматизации технологической подготовки производства с элементами интеллектуализации процессов проектирования; совершенствование технологий механосборочных производств с целью повышения качества, надежности и долговечности работы деталей в машине и машины в целом; рационализация применения современного технологического оборудования и технологического оснащения; повышение производительности механообрабатывающих производств за счет оптимизации технологических факторов."
            },
            {
                title: "Секция 3. Автоматизация и управление системами и технологическими процессами",
                person: "Игнатьев Александр Анатольевич",
                personDescription: "д.т.н., профессор, зав. кафедрой «Автоматизация, управление и мехатроника»",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/240",
                desc: "Секция посвящена обсуждению результатов исследований в области теории и практики применения автоматических систем управления в различных отраслях промышленности. При этом основное внимание уделяется рассмотрению вопросов, связанных с разработкой методов искусственного интеллекта для промышленности, систем технического зрения, автоматизацией конструкторской и технологической подготовкой производства, создание мехатронных систем и робототехнических комплексов; мониторинга технологического процесса, диагностирование технологического оборудования, информационно-измерительные системы в промышленности,  современные элементы автоматики и системы управления, информатизация в промышленности."
            },
            {
                title: "Секция 4. Приборостроение, элементы и устройства информационно-измерительных и управляющих систем",
                person: "Мельников Леонид Аркадьевич",
                personDescription: "д.ф-м.н., профессор, заведующий кафедрой «Приборостроение»",
                date: "23 октября пятница, 10:00 – 17:00",
                where: "ауд. 2/503 ",
                desc: "На секции рассматриваются вопросы разработки (анализа и синтеза) сложных цифровых информационно-измерительных и информационно-управляющих систем. Анализируются результаты исследований различных цифровых блоков, устройств и систем, включая датчиковую аппаратуру, АЦП, ЦАП как составляющих элементов сложных цифровых систем. Исследуются вопросы оценок и повышения надежности элементов и устройств систем управления, обработки и передачи информации. Рассматриваются вопросы теоретической нелинейной динамики, в том числе вопросы  нелинейной динамики лазеров и волоконно-оптических систем, методы повышения эффективности гироскопических и навигационных приборов и систем."
            },
            {
                title: "Секция 5. Металлургия и материаловедение",
                person: " Родионов  Игорь Владимирович ",
                personDescription: "д.т .н. заведующий кафедрой «Сварка и металлургия». Руководитель департамента инновационных технологий Академии инноватики «Глобеликс-Р»",
                date: "23 октября пятница, 10:00 – 17:00",
                where: "ауд. 2/130",
                desc: "Работа секции посвящена  современным материалам и покрытиям. В последнее десятилетие в высокоразвитых странах интенсивно ведутся фундаментальные и технологические исследования в области разработки и создания микроструктурных материалов с заданным набором структурных и функциональных свойств – композитные материалы. Силикатные, слоистые, биоволокнистые, интерметаллидные, алмазные, углеродполимерные, керамические композиты могут иметь нано-, микро-, мезо- и макроструктуру. Специальные свойства этого класса соединений и покрытий делают их чрезвычайно привлекательными для применения в машиностроении, энергетике, приборостроении и других отраслях производства. Разработка основ новых промышленно-ориентированных лазерных, плазменных, электроэрозионных, ионно-лучевых технологий, управляемого получения материалов и покрытий с заданными физико-механическими свойствами имеют в настоящее время приоритетное значение."
            },
            {
                title: "Секция 6.  Моделирование и информационные технологии в машино- и приборостроении",
                person: "Байбурин Вил Бариевич",
                personDescription: "д.ф-м. н. профессор зав. кафедрой «Информационная безопасность автоматизированных систем»",
                date: "22 октября пятница, 10:00 – 17:00",
                where: "ауд. 1/259",
                desc: "На секции представляются доклады, посвященные созданию математических моделей различных технических и технологических процессов и систем, а также соответствующих вычислительных схем их реализации на основе компьютерных технологий. Представляются результаты математического моделирования, их анализ для интерпретации моделируемых явлений, использования в задачах управления, оптимизации и т.п. Предлагаются численные методы для реализации математических моделей на компьютере, исследуются их свойства. В докладах секции рассматриваются вопросы программной реализации различных методов защиты информации в вычислительных сетях, в сетях локального и распределенного управления."
            },
            {
                title: "Секция 7.  Электротехнология и комбинированная обработка",
                person: "Бекренев Николай Валерьевич",
                personDescription: "профессор, д.т.н., зав. кафедрой «Техническая механика и детали машин»",
                date: "24 октября суббота, 10:00 – 14:00",
                where: "ауд. 1/242",
                desc: "На секции рассматриваются проблемы обработки сложноконтурных деталей из высокопрочных, твердых материалов электрофизическими методами, в том числе концентрированными потоками энергии (электроэрозионная и электроимпульсная обработка, ультразвуковая размерная обработка, лазерная и электронно-лучевая обработка, обработка струей жидкости). Также рассматриваются процессы механической обработки материалов с дополнительным энергетическим воздействием (ультразвуковое резание, резание с электродуговым подогревом, наплавка с последующим резанием и т.п.). Также рассматриваются вопросы, содержащие результаты разработки специального электрофизического технологического оборудования, модернизации универсального оборудования для осуществления комбинированных процессов на современных производствах ."
            },
            {
                title: "Секция   8. Образование  для инженерного кластера",
                person: "Джашитов Александр Эммануилович",
                personDescription: "к.т.н.,  доцент   кафедры  «Техническая механика и детали машин» член Общественной палаты Саратовской области",
                date: "24 октября суббота, 10:00 – 14:00",
                where: "ауд. 1/262",
                desc: "Работа секции посвящена вопросам  возрождения   высокого уровня инженерного образования в России. Рассматриваются вопросы, касающиеся  изменения  в системе подготовки специалистов в технических вузах (переход на новые Федеральные государственные образовательные стандарты;  профессионально ориентированная системная подготовка,  повышение квалификации и переподготовка  инженерного персонала для предприятий, научных и проектных организаций; качество подготовки  инженеров  на  соответствие потребностям высокотехнологичных отраслей экономики РФ;  обмен знаниями в научно-исследовательской и производственно-технологической деятельности – в   профессиональную  преподавательскую сферу деятельности).  Обмен опытом ведущих вузов России и иностранных партнеров в вопросах организации эффективного образовательного процесса, разработки и применения инновационных образовательных методик, повышения качества инженерного образования."
            }
        ];
    }]);

engineeringControllers.controller( 'PublishController', ['$scope', 'VisibilityFactory',
    function ($scope, VisibilityFactory) {
        $scope.visibility = VisibilityFactory.data;

        $scope.certificates_2015 = [
            {name:"Абдряшитова В.Р.", path: "/files/certs2015/Абдряшитова В.Р..pdf"},
            {name:"Агапова А.А.", path: "/files/certs2015/Агапова А.А..pdf"},
            {name:"Азад А.М.", path: "/files/certs2015/Азад А.М..pdf"},
            {name:"Ахметова Ш.Д.", path: "/files/certs2015/Ахметова Ш.Д..pdf"},
            {name:"Бабенко А.И.", path: "/files/certs2015/Бабенко А.И..pdf"},
            {name:"Бабенко М.Г.", path: "/files/certs2015/Бабенко М.Г..pdf"},
            {name:"Балаев А.Ф.", path: "/files/certs2015/Балаев А.Ф..pdf"},
            {name:"Бахтиозин Р.Р.", path: "/files/certs2015/Бахтиозин Р.Р..pdf"},
            {name:"Бекренев Н.В.", path: "/files/certs2015/Бекренев Н.В..pdf"},
            {name:"Болотникова С.Н.", path: "/files/certs2015/Болотникова С.Н..pdf"},
            {name:"Бондаренко И.И.", path: "/files/certs2015/Бондаренко И.И..pdf"},
            {name:"Боровских В.Е.", path: "/files/certs2015/Боровских В.Е..pdf"},
            {name:"Боровских У.В.", path: "/files/certs2015/Боровских У.В..pdf"},
            {name:"Бочкарева А.П.", path: "/files/certs2015/Бочкарева А.П..pdf"},
            {name:"Брюзгин Г.В.", path: "/files/certs2015/Брюзгин Г.В..pdf"},
            {name:"Вавилина Н.А.", path: "/files/certs2015/Вавилина Н.А..pdf"},
            {name:"Викулова М.А.", path: "/files/certs2015/Викулова М.А..pdf"},
            {name:"Виноградов М.В.", path: "/files/certs2015/Виноградов М.В..pdf"},
            {name:"Водясова А.А.", path: "/files/certs2015/Водясова А.А..pdf"},
            {name:"Войко А.В.", path: "/files/certs2015/Войко А.В..pdf"},
            {name:"Воронин Д.В.", path: "/files/certs2015/Воронин Д.В..pdf"},
            {name:"Гавкина М.С.", path: "/files/certs2015/Гавкина М.С..pdf"},
            {name:"Ганушкин А.", path: "/files/certs2015/Ганушкин А..pdf"},
            {name:"Горбачев В.О.", path: "/files/certs2015/Горбачев В.О..pdf"},
            {name:"Горшков Н.В.", path: "/files/certs2015/Горшков Н.В..pdf"},
            {name:"Горячев А.И.", path: "/files/certs2015/Горячев А.И..pdf"},
            {name:"Горячев И.А.", path: "/files/certs2015/Горячев И.А..pdf"},
            {name:"Гришанов И.А.", path: "/files/certs2015/Гришанов И.А..pdf"},
            {name:"Громилова О.В.", path: "/files/certs2015/Громилова О.В..pdf"},
            {name:"Гузашвили К.В.", path: "/files/certs2015/Гузашвили К.В..pdf"},
            {name:"Гуревич Л.М.", path: "/files/certs2015/Гуревич Л.М..pdf"},
            {name:"Гусева Н.В.", path: "/files/certs2015/Гусева Н.В..pdf"},
            {name:"Гуцевич Д.Е.", path: "/files/certs2015/Гуцевич Д.Е..pdf"},
            {name:"Гягяева А.Г.", path: "/files/certs2015/Гягяева А.Г..pdf"},
            {name:"Джашитов А.Э.", path: "/files/certs2015/Джашитов А.Э..pdf"},
            {name:"Добряков В.А.", path: "/files/certs2015/Добряков В.А..pdf"},
            {name:"Дронова С.Н.", path: "/files/certs2015/Дронова С.Н..pdf"},
            {name:"Дударева О.А.", path: "/files/certs2015/Дударева О.А..pdf"},
            {name:"Евстропов Д.А.", path: "/files/certs2015/Евстропов Д.А..pdf"},
            {name:"Емжна Д.С.", path: "/files/certs2015/Емжна Д.С..pdf"},
            {name:"Железников Ю.А.", path: "/files/certs2015/Железников Ю.А..pdf"},
            {name:"Зарипов А.Ф.", path: "/files/certs2015/Зарипов А.Ф..pdf"},
            {name:"Захарченко М.Ю.", path: "/files/certs2015/Захарченко М.Ю..pdf"},
            {name:"Злобина И.В.", path: "/files/certs2015/Злобина И.В..pdf"},
            {name:"Зоркин А.Я.", path: "/files/certs2015/Зоркин А.Я..pdf"},
            {name:"Зхаров О.В.", path: "/files/certs2015/Зхаров О.В..pdf"},
            {name:"Игнатьев А.А.", path: "/files/certs2015/Игнатьев А.А..pdf"},
            {name:"Игнатьев С.А.", path: "/files/certs2015/Игнатьев С.А..pdf"},
            {name:"Изнаиров Б.М.", path: "/files/certs2015/Изнаиров Б.М..pdf"},
            {name:"Истрашкина М.В.", path: "/files/certs2015/Истрашкина М.В..pdf"},
            {name:"Казинский Н.А.", path: "/files/certs2015/Казинский Н.А..pdf"},
            {name:"Канубриков И.А.", path: "/files/certs2015/Канубриков И.А..pdf"},
            {name:"Карпов К.А.", path: "/files/certs2015/Карпов К.А..pdf"},
            {name:"Касимов С.А.", path: "/files/certs2015/Касимов С.А..pdf"},
            {name:"Каххаров С.Н.", path: "/files/certs2015/Каххаров С.Н..pdf"},
            {name:"Ковалев М.С.", path: "/files/certs2015/Ковалев М.С..pdf"},
            {name:"Кожанов Р.В.", path: "/files/certs2015/Кожанов Р.В..pdf"},
            {name:"Кожанова Е.Р.", path: "/files/certs2015/Кожанова Е.Р..pdf"},
            {name:"Коновалов В.В.", path: "/files/certs2015/Коновалов В.В..pdf"},
            {name:"Кораблев А.М.", path: "/files/certs2015/Кораблев А.М..pdf"},
            {name:"Королев А.А.", path: "/files/certs2015/Королев А.А..pdf"},
            {name:"Королев А.В.", path: "/files/certs2015/Королев А.В..pdf"},
            {name:"Косарев А.В.", path: "/files/certs2015/Косарев А.В..pdf"},
            {name:"Котина Н.М.", path: "/files/certs2015/Котина Н.М..pdf"},
            {name:"Кошуро В.А.", path: "/files/certs2015/Кошуро В.А..pdf"},
            {name:"Кузьмин И.А.", path: "/files/certs2015/Кузьмин И.А..pdf"},
            {name:"Куклев А.", path: "/files/certs2015/Куклев А..pdf"},
            {name:"Куц Л.Е.", path: "/files/certs2015/Куц Л.Е..pdf"},
            {name:"Леготин Е.С.", path: "/files/certs2015/Леготин Е.С..pdf"},
            {name:"Лукьянов А.А.", path: "/files/certs2015/Лукьянов А.А..pdf"},
            {name:"Лясников В.Н.", path: "/files/certs2015/Лясников В.Н..pdf"},
            {name:"Лясникова А.В.", path: "/files/certs2015/Лясникова А.В..pdf"},
            {name:"Маркелова О.А.", path: "/files/certs2015/Маркелова О.А..pdf"},
            {name:"Мартынова Г.В.", path: "/files/certs2015/Мартынова Г.В..pdf"},
            {name:"Махамбетова Ж.С.", path: "/files/certs2015/Махамбетова Ж.С..pdf"},
            {name:"Меркурбанов Р.Д.", path: "/files/certs2015/Меркурбанов Р.Д..pdf"},
            {name:"Мирзин Р.А.", path: "/files/certs2015/Мирзин Р.А..pdf"},
            {name:"Мирошкин А.Г.", path: "/files/certs2015/Мирошкин А.Г..pdf"},
            {name:"Морозова Т.П.", path: "/files/certs2015/Морозова Т.П..pdf"},
            {name:"Мотков А.Г.", path: "/files/certs2015/Мотков А.Г..pdf"},
            {name:"Мукатова Г.Х.", path: "/files/certs2015/Мукатова Г.Х..pdf"},
            {name:"Мулдашева Г.К.", path: "/files/certs2015/Мулдашева Г.К..pdf"},
            {name:"Мурзахметова У.А.", path: "/files/certs2015/Мурзахметова У.А..pdf"},
            {name:"Мухамедов А.А.", path: "/files/certs2015/Мухамедов А.А..pdf"},
            {name:"Мухина Е.В.", path: "/files/certs2015/Мухина Е.В..pdf"},
            {name:"Никишин В.Б.", path: "/files/certs2015/Никишин В.Б..pdf"},
            {name:"Новиков Р.Е.", path: "/files/certs2015/Новиков Р.Е..pdf"},
            {name:"Новокшонов С.И.", path: "/files/certs2015/Новокшонов С.И..pdf"},
            {name:"Нургалиев Е.Р.", path: "/files/certs2015/Нургалиев Е.Р..pdf"},
            {name:"Нургожинов М.Б.", path: "/files/certs2015/Нургожинов М.Б..pdf"},
            {name:"Овчинникова Н.В.", path: "/files/certs2015/Овчинникова Н.В..pdf"},
            {name:"Онищенко Н.В.", path: "/files/certs2015/Онищенко Н.В..pdf"},
            {name:"Орлова М.Д.", path: "/files/certs2015/Орлова М.Д..pdf"},
            {name:"Палканов П.А.", path: "/files/certs2015/Палканов П.А..pdf"},
            {name:"Парфенова А.Д.", path: "/files/certs2015/Парфенова А.Д..pdf"},
            {name:"Перевозникова Я.В,", path: "/files/certs2015/Перевозникова Я.В,.pdf"},
            {name:"Петров А.А.", path: "/files/certs2015/Петров А.А..pdf"},
            {name:"Петрова Е.П.", path: "/files/certs2015/Петрова Е.П..pdf"},
            {name:"Пичхидзе С.Я.", path: "/files/certs2015/Пичхидзе С.Я..pdf"},
            {name:"Полосухин В.С.", path: "/files/certs2015/Полосухин В.С..pdf"},
            {name:"Порунов А.А.", path: "/files/certs2015/Порунов А.А..pdf"},
            {name:"Пояркина Ю.А.", path: "/files/certs2015/Пояркина Ю.А..pdf"},
            {name:"Пронин Ю.О.", path: "/files/certs2015/Пронин Ю.О..pdf"},
            {name:"Просин И.И.", path: "/files/certs2015/Просин И.И..pdf"},
            {name:"Пушкова А.С.", path: "/files/certs2015/Пушкова А.С..pdf"},
            {name:"Равутов Ш.Т.", path: "/files/certs2015/Равутов Ш.Т..pdf"},
            {name:"Радзевский И.И.", path: "/files/certs2015/Радзевский И.И..pdf"},
            {name:"Раздолгина Д.М.", path: "/files/certs2015/Раздолгина Д.М..pdf"},
            {name:"Рахматуллаева Д.А.", path: "/files/certs2015/Рахматуллаева Д.А..pdf"},
            {name:"Резков И.Г.", path: "/files/certs2015/Резков И.Г..pdf"},
            {name:"Решетникова Е.П.", path: "/files/certs2015/Решетникова Е.П..pdf"},
            {name:"Родионов И.В.", path: "/files/certs2015/Родионов И.В..pdf"},
            {name:"Ромахин А.Н.", path: "/files/certs2015/Ромахин А.Н..pdf"},
            {name:"Ростунцова И.А.", path: "/files/certs2015/Ростунцова И.А..pdf"},
            {name:"Рыльцов Д.С.", path: "/files/certs2015/Рыльцов Д.С..pdf"},
            {name:"Савран С.А.", path: "/files/certs2015/Савран С.А..pdf"},
            {name:"Сайфуллина А.Х.", path: "/files/certs2015/Сайфуллина А.Х..pdf"},
            {name:"Самойлова Е.М.", path: "/files/certs2015/Самойлова Е.М..pdf"},
            {name:"Сафина В.М.", path: "/files/certs2015/Сафина В.М..pdf"},
            {name:"Седов А.А.", path: "/files/certs2015/Седов А.А..pdf"},
            {name:"Сигитов Е.А.", path: "/files/certs2015/Сигитов Е.А..pdf"},
            {name:"Сидоренко А.Д.", path: "/files/certs2015/Сидоренко А.Д..pdf"},
            {name:"Синева Я.А.", path: "/files/certs2015/Синева Я.А..pdf"},
            {name:"Скляров И.А.", path: "/files/certs2015/Скляров И.А..pdf"},
            {name:"Склярова А.И.", path: "/files/certs2015/Склярова А.И..pdf"},
            {name:"Сладкова О.М.", path: "/files/certs2015/Сладкова О.М..pdf"},
            {name:"Смирнова С.В.", path: "/files/certs2015/Смирнова С.В..pdf"},
            {name:"Сперанский К.С.", path: "/files/certs2015/Сперанский К.С..pdf"},
            {name:"Сперанский С.К.", path: "/files/certs2015/Сперанский С.К..pdf"},
            {name:"Стаценко А.М.", path: "/files/certs2015/Стаценко А.М..pdf"},
            {name:"Ступников Д.И.", path: "/files/certs2015/Ступников Д.И..pdf"},
            {name:"Суслин Г.А.", path: "/files/certs2015/Суслин Г.А..pdf"},
            {name:"Тищенко А.А.", path: "/files/certs2015/Тищенко А.А..pdf"},
            {name:"Тищенко О.Д.", path: "/files/certs2015/Тищенко О.Д..pdf"},
            {name:"Ткаченко А.А.", path: "/files/certs2015/Ткаченко А.А..pdf"},
            {name:"Ткаченко И.М.", path: "/files/certs2015/Ткаченко И.М..pdf"},
            {name:"Трефилов П.А.", path: "/files/certs2015/Трефилов П.А..pdf"},
            {name:"Трефилова Г.М.", path: "/files/certs2015/Трефилова Г.М..pdf"},
            {name:"Тюрина М.М.", path: "/files/certs2015/Тюрина М.М..pdf"},
            {name:"Фадеева Н.С.", path: "/files/certs2015/Фадеева Н.С..pdf"},
            {name:"Файзутдинов Р.Н.", path: "/files/certs2015/Файзутдинов Р.Н..pdf"},
            {name:"Федосеев М.Е.", path: "/files/certs2015/Федосеев М.Е..pdf"},
            {name:"Филенко В.В.", path: "/files/certs2015/Филенко В.В..pdf"},
            {name:"Фокин С.В.", path: "/files/certs2015/Фокин С.В..pdf"},
            {name:"Фомин А.А.", path: "/files/certs2015/Фомин А.А..pdf"},
            {name:"Фомина М.А.", path: "/files/certs2015/Фомина М.А..pdf"},
            {name:"Хлебалин П.А.", path: "/files/certs2015/Хлебалин П.А..pdf"},
            {name:"Челышева И.А.", path: "/files/certs2015/Челышева И.А..pdf"},
            {name:"Черкасова О.А.", path: "/files/certs2015/Черкасова О.А..pdf"},
            {name:"Черкасова С.А.", path: "/files/certs2015/Черкасова С.А..pdf"},
            {name:"Чигирев П.Г.", path: "/files/certs2015/Чигирев П.Г..pdf"},
            {name:"Чугошкина А.В.", path: "/files/certs2015/Чугошкина А.В..pdf"},
            {name:"Шаповалов А.А.", path: "/files/certs2015/Шаповалов А.А..pdf"},
            {name:"Шокобаева Г.Т.", path: "/files/certs2015/Шокобаева Г.Т..pdf"},
            {name:"Шорин В.С.", path: "/files/certs2015/Шорин В.С..pdf"},
            {name:"Штейнфельд М.П,", path: "/files/certs2015/Штейнфельд М.П,.pdf"},
            {name:"Щелкунов А.Ю.", path: "/files/certs2015/Щелкунов А.Ю..pdf"},
            {name:"Щуркин Д.О.", path: "/files/certs2015/Щуркин Д.О..pdf"}
        ];
    }]);
