/**
 * Created by nprikazchikov on 3/2/15.
 */

var engineeringControllers = angular.module('engineeringControllers', []);

engineeringControllers.controller('HeaderController', ['$scope', '$location', 'VisibilityFactory', '$translate',
    function ($scope, $location, VisibilityFactory, $translate) {
        $scope.$location = $location;

        $scope.changeLanguage = function (langKey) {
            $translate.use(langKey);
        };

        $scope.toggleFilter = function () {
            VisibilityFactory.data.filter = !VisibilityFactory.data.filter;
        }
    }]);

engineeringControllers.controller( 'DefaultController', ['$scope', 'VisibilityFactory',
    function ($scope, VisibilityFactory) {
        $scope.visibility = VisibilityFactory.data;
    }]);

engineeringControllers.controller( 'ProgramController', ['$scope', 'VisibilityFactory',
    function ($scope, VisibilityFactory) {
        $scope.visibility = VisibilityFactory.data;

        $scope.reports = [
            {
                author:"Боровских Валентин Ефимович",
                title: "«Современные проблемы оценки ресурса  транспортных машин»",
                desc:"д.т.н.,  профессора кафедры  «Техническая механика и детали машин» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Архангельсий  Юри  Сергеевич",
                title: "«Принципы создания интеллектуальных СВЧ технологических установок»",
                desc:"д.т.н., профессора кафедры  «Автоматизированные электротехнологические установки и системы » СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Бекренев Николай  Валерьевич",
                title: "«Актуальные проблемы конструирования и технологии производства технологических, транспортных и энергетических машин в свете решения задачи импортозамещения в ключевых областях техники»",
                desc:"д.т.н., профессора, заведующего  кафедрой «Техническая механика и детали машин» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Погораздов Валерий Васильевич",
                title: "«Концепция суперфинишного формообразования тел качения переменной кривизны»",
                desc:"д.т.н., профессора кафедры  «Проектирование технических и технологических комплексов» СГТУ имени Гагарина Ю.А"
            },
            {
                author:"Астахов Владимир Владимирович",
                title: "«Нелинейные эффекты в хаотических и стохастических системах»",
                desc:"д. ф-м. н., профессора, заведующего кафедрой «Радиоэлектроника и телекоммуникации» СГТУ имени Гагарина Ю.А"
            }
        ];

        $scope.sections = [
            {
                title: "Секция 1. Машиноведение, транспортное и энергетическое машиностроение",
                person: "Боровских Валентин Ефимович",
                personDescription: "д.т.н., профессор кафедры «Техническая механика и детали машин,  эксперт ФГБНУ НИИ РИНКЦЭ",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/242",
                desc: "Секция посвящена обсуждению результатов исследований в области расчета и проектирования технических систем;  исследование процессов формообразования сложных поверхностей с применением 3D компьютерных технологий;  оценка прочности и устойчивости элементов  металлоконструкций от действия статической нагрузки; режимы нагружения различных машин и их эксплуатационный ресурс; современные методы оценки ресурса элементов конструкций, работающих в условиях нагрузок переменных во времени; новые подходы к оценке и учету трения в проектируемых технических системах; вопросы проектирования несущих систем транспортных машин; вопросы обеспечения точности и надежности мехатронных систем различного назначения; рассматриваются различные подходы к построению математических моделей технологических процессов: аналитические, экспериментальные, экспериментально-аналитические; анализ для интерпретации моделируемых явлений, использование в задачах управления, оптимизации и т.п."
            },
            {
                title: "Секция 2. Технология машиностроения",
                person: "Королев Альберт Викторович",
                personDescription: "д.т.н., профессор кафедры «Технология машиностроения»",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/259",
                desc: "Секция посвящена обсуждению результатов теоретических и экспериментальных        исследований, связанных с проблемам совершенствования технологического обеспечения, механообрабатывающих и механосборочных производств. Особое внимание уделяется ресурсосберегающим безотходным и малоотходным технологиям; автоматизации технологической подготовки производства с элементами интеллектуализации процессов проектирования; совершенствование технологий механосборочных производств с целью повышения качества, надежности и долговечности работы деталей в машине и машины в целом; рационализация применения современного технологического оборудования и технологического оснащения; повышение производительности механообрабатывающих производств за счет оптимизации технологических факторов."
            },
            {
                title: "Секция 3. Автоматизация и управление системами и технологическими процессами",
                person: "Игнатьев Александр Анатольевич",
                personDescription: "д.т.н., профессор, зав. кафедрой «Автоматизация, управление и мехатроника»",
                date: "22 октября четверг, 14:00 – 17:00",
                where: "ауд. 1/240",
                desc: "Секция посвящена обсуждению результатов исследований в области теории и практики применения автоматических систем управления в различных отраслях промышленности. При этом основное внимание уделяется рассмотрению вопросов, связанных с разработкой методов искусственного интеллекта для промышленности, систем технического зрения, автоматизацией конструкторской и технологической подготовкой производства, создание мехатронных систем и робототехнических комплексов; мониторинга технологического процесса, диагностирование технологического оборудования, информационно-измерительные системы в промышленности,  современные элементы автоматики и системы управления, информатизация в промышленности."
            },
            {
                title: "Секция 4. Приборостроение, элементы и устройства информационно-измерительных и управляющих систем",
                person: "Мельников Леонид Аркадьевич",
                personDescription: "д.ф-м.н., профессор, заведующий кафедрой «Приборостроение»",
                date: "23 октября пятница, 10:00 – 17:00",
                where: "ауд. 2/503 ",
                desc: "На секции рассматриваются вопросы разработки (анализа и синтеза) сложных цифровых информационно-измерительных и информационно-управляющих систем. Анализируются результаты исследований различных цифровых блоков, устройств и систем, включая датчиковую аппаратуру, АЦП, ЦАП как составляющих элементов сложных цифровых систем. Исследуются вопросы оценок и повышения надежности элементов и устройств систем управления, обработки и передачи информации. Рассматриваются вопросы теоретической нелинейной динамики, в том числе вопросы  нелинейной динамики лазеров и волоконно-оптических систем, методы повышения эффективности гироскопических и навигационных приборов и систем."
            },
            {
                title: "Секция 5. Металлургия и материаловедение",
                person: " Родионов  Игорь Владимирович ",
                personDescription: "д.т .н. заведующий кафедрой «Сварка и металлургия». Руководитель департамента инновационных технологий Академии инноватики «Глобеликс-Р»",
                date: "23 октября пятница, 10:00 – 17:00",
                where: "ауд. 2/130",
                desc: "Работа секции посвящена  современным материалам и покрытиям. В последнее десятилетие в высокоразвитых странах интенсивно ведутся фундаментальные и технологические исследования в области разработки и создания микроструктурных материалов с заданным набором структурных и функциональных свойств – композитные материалы. Силикатные, слоистые, биоволокнистые, интерметаллидные, алмазные, углеродполимерные, керамические композиты могут иметь нано-, микро-, мезо- и макроструктуру. Специальные свойства этого класса соединений и покрытий делают их чрезвычайно привлекательными для применения в машиностроении, энергетике, приборостроении и других отраслях производства. Разработка основ новых промышленно-ориентированных лазерных, плазменных, электроэрозионных, ионно-лучевых технологий, управляемого получения материалов и покрытий с заданными физико-механическими свойствами имеют в настоящее время приоритетное значение."
            },
            {
                title: "Секция 6.  Моделирование и информационные технологии в машино- и приборостроении",
                person: "Байбурин Вил Бариевич",
                personDescription: "д.ф-м. н. профессор зав. кафедрой «Информационная безопасность автоматизированных систем»",
                date: "22 октября пятница, 10:00 – 17:00",
                where: "ауд. 1/259",
                desc: "На секции представляются доклады, посвященные созданию математических моделей различных технических и технологических процессов и систем, а также соответствующих вычислительных схем их реализации на основе компьютерных технологий. Представляются результаты математического моделирования, их анализ для интерпретации моделируемых явлений, использования в задачах управления, оптимизации и т.п. Предлагаются численные методы для реализации математических моделей на компьютере, исследуются их свойства. В докладах секции рассматриваются вопросы программной реализации различных методов защиты информации в вычислительных сетях, в сетях локального и распределенного управления."
            },
            {
                title: "Секция 7.  Электротехнология и комбинированная обработка",
                person: "Бекренев Николай Валерьевич",
                personDescription: "профессор, д.т.н., зав. кафедрой «Техническая механика и детали машин»",
                date: "24 октября суббота, 10:00 – 14:00",
                where: "ауд. 1/242",
                desc: "На секции рассматриваются проблемы обработки сложноконтурных деталей из высокопрочных, твердых материалов электрофизическими методами, в том числе концентрированными потоками энергии (электроэрозионная и электроимпульсная обработка, ультразвуковая размерная обработка, лазерная и электронно-лучевая обработка, обработка струей жидкости). Также рассматриваются процессы механической обработки материалов с дополнительным энергетическим воздействием (ультразвуковое резание, резание с электродуговым подогревом, наплавка с последующим резанием и т.п.). Также рассматриваются вопросы, содержащие результаты разработки специального электрофизического технологического оборудования, модернизации универсального оборудования для осуществления комбинированных процессов на современных производствах ."
            },
            {
                title: "Секция   8. Образование  для инженерного кластера",
                person: "Джашитов Александр Эммануилович",
                personDescription: "к.т.н.,  доцент   кафедры  «Техническая механика и детали машин» член Общественной палаты Саратовской области",
                date: "24 октября суббота, 10:00 – 14:00",
                where: "ауд. 1/262",
                desc: "Работа секции посвящена вопросам  возрождения   высокого уровня инженерного образования в России. Рассматриваются вопросы, касающиеся  изменения  в системе подготовки специалистов в технических вузах (переход на новые Федеральные государственные образовательные стандарты;  профессионально ориентированная системная подготовка,  повышение квалификации и переподготовка  инженерного персонала для предприятий, научных и проектных организаций; качество подготовки  инженеров  на  соответствие потребностям высокотехнологичных отраслей экономики РФ;  обмен знаниями в научно-исследовательской и производственно-технологической деятельности – в   профессиональную  преподавательскую сферу деятельности).  Обмен опытом ведущих вузов России и иностранных партнеров в вопросах организации эффективного образовательного процесса, разработки и применения инновационных образовательных методик, повышения качества инженерного образования."
            }
        ];
    }]);
